Autodesk.Revit.DB.IFC.IFCHybridImportOptions.ToString(Autodesk.Revit.DB.IFC.IFCHybridImportOptions)
Converts the IFCHybridImportOptions class to a revit.ini-compatible string.
Remarks:
A null IFCHybridImportOptions will assume that this is a legacy import.
options:
The optional IFCHybridImportOptions class.
Returns:
The options string.
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImportOptions.Create(System.String)
Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode.
optionString:
The options string.
Returns:
The IFCHybridImportOptions, or null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCHybridImportOptions.HybridPropertySets
True if we should use AnyCAD to process property sets, false otherwise.
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImportOptions.HybridLevels
True if we should use AnyCAD to process levels, false otherwise.
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImportOptions.HybridGrids
True if we should use AnyCAD to process grids, false otherwise.
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImportOptions
A set of options to decide on extra AnyCAD processing.
Since:
2026